#Command# --> ()
Command/#print# --> (Hello)
#Clean# --> ()
Clean/#print# --> (World)
#block# --> (parameter0, parameter1)
block/#command# --> (parameter2, parameter4)
#comm1# --> ([param1, param2, param3])
#comm2# --> (param0, [param1, param2, param3])
#comm3# --> ([[param1, param2], param1, [param3]], context = specific_parametrs, are_also = supported and can be quieried)
#comm4# --> (sub-param, [[param1, param2], param1, [param3]], big string value)
#comm5# --> ()
comm5/#comm6# --> ([[param1, param2]])
comm5/#comm7# --> ()
comm5/comm7/#comm8# --> ()
comm5/comm7/comm8/#multi_line_string# --> (some multi line
	string is added )
#comm9# --> ([[param1 = list, param2 = special], param1 = parameters, [param3 = are also possible]])

-- text : text : atextreg

So this is what was expected.
Everything working. No big deal.
Lets check if this actually works.

Last line of operation.

-- text --
#block# --> (parameter0, parameter1)
block/#command# --> (parameter2, parameter4)
#templ# --> ()
templ/#print# --> (Hello)
#templ2# --> ()
templ2/#print# --> (World)
#templ3# --> ()
templ3/#print# --> (Hello)
templ3/#print# --> (B, C)
#templ4# --> ()
templ4/#print# --> (World, B, a = C, b = D)
